Insert

In [1]:
import pandas as pd

In [12]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})

In [13]:
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [4]:
var.insert(1,"python",var["A"])

In [5]:
var

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5

In [8]:
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [9]:
var["python_12"]=var["A"][:3]

In [11]:
var

   A  B  python_12
0  1  9        1.0
1  2  8        2.0
2  3  7        3.0
3  4  6        NaN
4  5  5        NaN

Delete Data

In [14]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[11,12,13,14,15]})

In [15]:
var

   A  B   C
0  1  9  11
1  2  8  12
2  3  7  13
3  4  6  14
4  5  5  15

In [16]:
var1 = var.pop("B")

In [17]:
var1

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

In [18]:
var

   A   C
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [19]:
del var["A"]

In [20]:
var

    C
0  11
1  12
2  13
3  14
4  15